#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//数组

//练习题1：打印用“* ”组成的X形图案
//输入描述：
//多组输入，一个整数（2~20），表示输出的行数，也表示组成“X”的反斜线和正斜线的长度。
//输出描述：
//针对每行输入，输出用“ * ”组成的X形图案。

//分析：1、i == j
//     2、i + j = n - 1
//     其余位置都为空格
//int main()
//{
//    int n;
//    while (scanf("%d", &n) != EOF)
//    { // 注意 while 处理多个 case
//        // 64 位输出请用 printf("%lld") to 
//        int i = 0;
//        for (i = 0;i < n;i++)
//        {
//            int j = 0;
//            for (j = 0;j < n;j++)
//            {
//                if (i == j || (i + j) == n - 1)
//                {
//                    printf("*");
//                }
//                else
//                    printf(" ");
//            }
//            printf("\n");
//        }
//    }
//    return 0;
//}


//练习题2:打印用“*”组成的“空心”正方形图案。
//输入描述：
//多组输入，一个整数（3~20），表示输出的行数，也表示组成正方形边的“ * ”的数量。
//输出描述：
//针对每行输入，输出用“ * ”组成的“空心”正方形，每个“ * ”后面有一个空格。
//int main() {
//    int n = 0;
//    while (scanf("%d", &n) != EOF)
//    { // 注意 while 处理多个 case
//        // 64 位输出请用 printf("%lld") to 
//        int i = 0;
//        int j = 0;
//        for (i = 0; i < n; i++)
//        {
//            for (j = 0; j < n; j++)
//            {
//                if ((i > 0 && i < n - 1) && (j > 0 && j < n - 1))
//                {
//                    printf("  ");
//                }
//                else
//                    printf("* ");
//            }
//            printf("\n");
//        }
//    }
//    return 0;
//}

//练习题3：将矩阵的行列互换得到的新矩阵称为转置矩阵
//输入描述：
//第一行包含两个整数n和m，表示一个矩阵包含n行m列，用空格分隔。(1≤n≤10, 1≤m≤10)
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n * m个数，表示第一个矩阵中的元素。
//输出描述：
//输出m行n列，为矩阵转置后的结果。每个数后面有一个空格。
//int main() {
//    int n, m;
//    int arr[10][10] = { 0 };
//    while (scanf("%d %d", &n, &m) != EOF) 
//    { // 注意 while 处理多个 case
//        // 64 位输出请用 printf("%lld") to 
//        int i, j;
//        for (i = 0;i < n;i++)
//        {
//            for (j = 0;j < m;j++)
//            {
//                scanf("%d",&arr[i][j]);
//            }
//        }
//        for (j = 0; j < m; j++)
//        {
//            for (i = 0;i < n;i++)
//            {
//                printf("%d ", arr[i][j]);
//            }
//            printf("\n");
//        }
//    }
//    return 0;
//}

//clang
//int main() {
//    int n, m;
//    scanf("%d %d", &n, &m);
//    int arr[n][m];
//    int i, j;
//    for (i = 0; i < n; i++)
//    {
//        for (j = 0; j < m; j++)
//        {
//            scanf("%d", &arr[i][j]);
//        }
//    }
//    for (j = 0; j < m; j++)
//    {
//        for (i = 0; i < n; i++)
//        {
//            printf("%d ", arr[i][j]);
//        }
//        printf("\n");
//    }
//    return 0;
//}


//练习题4：输入10个整数，要求按输入时的逆序把这10个数打印出来。逆序输出，就是按照输入相反的顺序打印这10个数。
//输入描述：
//一行，输入10个整数（范围 - 231~231 - 1），用空格分隔。
//输出描述：
//一行，逆序输出输入的10个整数，用空格分隔。

//int main() {
//    int arr[10] = {0};
//    int i = 0;
//    for (i = 0;i < 10;i++)
//    {
//        scanf("%d",&arr[i]);
//    }
//    for (i = 9;i >= 0;i--)
//    {
//        printf("%d ",arr[i]);
//    }
//    return 0;
//}


//练习题5:输入两个升序排列的序列，将两个序列合并为一个有序序列并输出。
//数据范围：1<=n,m<=1000;序列中的值满足1<=val<=30000
//输入描述：
//输入包含三行，
//第一行包含两个正整数n, m，用空格分隔。n表示第二行第一个升序序列中数字的个数，m表示第三行第二个升序序列中数字的个数。
//第二行包含n个整数，用空格分隔。
//第三行包含m个整数，用空格分隔。
//输出描述：
//输出为一行，输出长度为n + m的升序序列，即长度为n的升序序列和长度为m的升序序列中的元素重新进行升序序列排列合并。
//int main() {
//    int n, m;
//    scanf("%d %d",&n,&m);
//    int arr1[1000] = {0};
//    int arr2[1000] = {0};
//    for (int i = 0;i < n;i++)
//    {
//        scanf("%d",&arr1[i]);
//    }
//    for (int j = 0; j < m; j++)
//    {
//        scanf("%d", &arr2[j]);
//    }
//
//    int i = 0;
//    int j = 0;
//    while (i < n && j < m)
//    {
//        if (arr1[i] < arr2[j])
//        {
//            printf("%d ",arr1[i]);
//            i++;
//        }
//        else
//        {
//            printf("%d ", arr2[j]);
//            j++;
//        }
//    }
//    while (i < n)
//    {
//        printf("%d ", arr1[i]);
//        i++;
//    }
//    while (j < m)
//    {
//        printf("%d ", arr2[j]);
//        j++;
//    }
//    return 0;
//}


//练习题6：【一维数组】输入10个整数，求平均值
//编写一个程序，从用户输入中读取10个整数并存储在一个数组中。然后，计算并输出这些整数的平均值。
//int main()
//{
//	int arr[10] = {0};
//	scanf("%d",arr);
//	int sum = 0;
//	for (int i = 0;i < 10;i++)
//	{
//		sum += arr[i];
//	}
//	double avg = sum / 10.0;
//	printf("%lf\n",avg);
//	return 0;
//}


//练习题7：【一维数组】交换数组
//将数组A中的内容和数组B中的内容进行交换。（数组一样大）
//int main()
//{
//	int arr1[5] = {1,3,5,7,9};
//	int arr2[5] = {2,4,6,8,10};
//
//	for (int i = 0;i < 5;i++)
//	{
//		int tmp = arr1[i];
//		arr1[i] = arr2[i];
//		arr2[i] = tmp;
//	}
//	for (int i = 0; i < 5; i++)
//	{
//		printf("%d ", arr1[i]);
//	}
//	printf("\n");
//	for (int i = 0; i < 5; i++)
//	{
//		printf("%d ", arr2[i]);
//	}
//	printf("\n");
//	return 0;
//}




